Q2.  

'''  
두번째로 Pandas에서 지원하는 Dataframe을 다뤄보도록 하겠습니다.  
다음과 같이 과일과 야채 각각 정리된 데이터가 있습니다.   
이 두 데이터를 따로 보기엔 효율성이 떨어지니,  
각 표에 정리된 데이터를 각각 하나의 데이터 프레임으로 생성한 후   
다음 세부 구현을 진행해보세요.  

  - 두 데이터를 하나의 데이터로 결합해보세요.  
  - 결합한 데이터의 type을 이용해 데이터를 정렬해보세요.  
  - 최종적으로 과일과 야채 중 가장 비싼 가격의 합을 출력해보세요.  
    
'''  
  
import pandas as pd  
  
df1 = # Dataframe 1 columns=["Name", "Type", "Price"]   
df2 = # Dataframe 2 columns=["Name", "Type", "Price"]  
  
#df1, df2를 colums를 이용해 결합  
df3= #  
  
#Fruit와 Vegetable의 type에 따라 정렬하고, 가격을 내림차순으로 정리   
df_fruit = #  
df_veg = #  
  
#Fruit와 Vegetable 상위 2개의 가격의 합을 출력   
print("Sum of Top 2 Fruit Price :  ", #)   
print("Sum of Top 2 Vegetable Price : ", #)  


[출력 예시]  
Sum of Top 2 Fruit Price: 230  
Sum of Top 2 Vegetable Price : 150

In [1]:
import pandas as pd

In [3]:
df1 = {"Name" : ['cherry', 'mango', 'potato', 'onion'],
       "Type" : ['Fruit', 'Fruit', 'Vegetable', 'Vegetable'], 
       "Price": [100, 110, 60, 80]}   
df2 = {"Name" : ['pepper', 'carrot', 'banana', 'kiwi'],
       "Type" : ['Vegetable', 'Vegetable', 'Fruit', 'Fruit'], 
       "Price": [50, 70, 90, 120]}

In [4]:
df1

{'Name': ['cherry', 'mango', 'potato', 'onion'],
 'Type': ['Fruit', 'Fruit', 'Vegetable', 'Vegetable'],
 'Price': [100, 110, 60, 80]}

In [5]:
df2

{'Name': ['pepper', 'carrot', 'banana', 'kiwi'],
 'Type': ['Vegetable', 'Vegetable', 'Fruit', 'Fruit'],
 'Price': [50, 70, 90, 120]}

In [10]:
df3 = pd.DataFrame(df1, columns = ["Name", "Type", "Price"])
df3

     Name       Type  Price
0  cherry      Fruit    100
1   mango      Fruit    110
2  potato  Vegetable     60
3   onion  Vegetable     80

In [9]:
df4 = pd.DataFrame(df2, columns = ["Name", "Type", "Price"])
df4

     Name       Type  Price
0  pepper  Vegetable     50
1  carrot  Vegetable     70
2  banana      Fruit     90
3    kiwi      Fruit    120

In [12]:
# df3, df4를 colums를 이용해 결합  
df5 = pd.concat([df3, df4], axis=0)
df5

     Name       Type  Price
0  cherry      Fruit    100
1   mango      Fruit    110
2  potato  Vegetable     60
3   onion  Vegetable     80
0  pepper  Vegetable     50
1  carrot  Vegetable     70
2  banana      Fruit     90
3    kiwi      Fruit    120

In [36]:
# Fruit와 Vegetable의 type에 따라 정렬하고, 가격을 내림차순으로 정리   
df_fruit = df5[df5['Type'] == 'Fruit'].sort_values(by=df5.columns[2], ascending=False)
df_fruit

     Name   Type  Price
3    kiwi  Fruit    120
1   mango  Fruit    110
0  cherry  Fruit    100
2  banana  Fruit     90

In [37]:
df_veg = df5[df5['Type'] == 'Vegetable'].sort_values(by=df5.columns[2], ascending=False)
df_veg

     Name       Type  Price
3   onion  Vegetable     80
1  carrot  Vegetable     70
2  potato  Vegetable     60
0  pepper  Vegetable     50

In [42]:
#Fruit와 Vegetable 상위 2개의 가격의 합을 출력                   
print("Sum of Top 2 Fruit Price : {} ".format(sum(df_fruit['Price'].head(2)))) 
print("Sum of Top 2 Vegetable Price : {} ".format(sum(df_veg['Price'].head(2))))

Sum of Top 2 Fruit Price : 230
Sum of Top 2 Vegetable Price : 150